10/data/attachments/bdce19a92e2ad4f1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>John_admit_Friend_9228_2</nif:username>
            <nif:friendToBeRequested>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>